# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. 🙂

In [4]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you’ll―of course―overcome them with what you learned in class! 😉

## Food Choices Data Set

### Load the Data

In [79]:
# Load the Food choices data set into a variable (e.g., df_food).
food_data_set_path = '../data/food_coded.csv'
df_food = pd.read_csv(food_data_set_path)

In [80]:
df_food.head(2)

,GPA,Gender,breakfast,calories_chicken,calories_day,calories_scone,coffee,comfort_food,comfort_food_reasons,comfort_food_reasons_coded,...,soup,sports,thai_food,tortilla_calories,turkey_calories,type_sports,veggies_day,vitamins,waffle_calories,weight
0,2.4,2,1,430,NaN,315.0,1,none,we dont have comfort,9.0,...,1.0,1.0,1,1165.0,345,car racing,5,1,1315,187
1,3.654,1,1,610,3.0,420.0,2,"chocolate, chips, ice cream","Stress, bored, anger",1.0,...,1.0,1.0,2,725.0,690,Basketball,4,2,900,155

### Explore the Data

How much data did you just load?

In [10]:
# Count by hand. (lol kidding)
df_food.shape

(125, 61)

What are the columns and their types in this data set?

In [12]:
# Show the column names and their types.
df_food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   GPA                           123 non-null    object
 1   Gender                        125 non-null    int64
 2   breakfast                     125 non-null    int64
 3   calories_chicken              125 non-null    int64
 4   calories_day                  106 non-null    float64
 5   calories_scone                124 non-null    float64
 6   coffee                        125 non-null    int64
 7   comfort_food                  124 non-null    object
 8   comfort_food_reasons          124 non-null    object
 9   comfort_food_reasons_coded    106 non-null    float64
 10  cook                          122 non-null    float64
 11  comfort_food_reasons_coded.1  125 non-null    int64
 12  cuisine                       108 non-null    float64
 13  diet_current                  124 non-null    object
 14  diet_current_coded            125 non-null    int64
 15  drink                         123 non-null    float64
 16  eating_changes                122 non-null    object
 17  eating_changes_coded          125 non-null    int64
 18  eating_changes_coded1         125 non-null    int64
 19  eating_out                    125 non-null    int64
 20  employment                    116 non-null    float64
 21  ethnic_food                   125 non-null    int64
 22  exercise                      112 non-null    float64
 23  father_education              124 non-null    float64
 24  father_profession             122 non-null    object
 25  fav_cuisine                   123 non-null    object
 26  fav_cuisine_coded             125 non-null    int64
 27  fav_food                      123 non-null    float64
 28  food_childhood                124 non-null    object
 29  fries                         125 non-null    int64
 30  fruit_day                     125 non-null    int64
 31  grade_level                   125 non-null    int64
 32  greek_food                    125 non-null    int64
 33  healthy_feeling               125 non-null    int64
 34  healthy_meal                  124 non-null    object
 35  ideal_diet                    124 non-null    object
 36  ideal_diet_coded              125 non-null    int64
 37  income                        124 non-null    float64
 38  indian_food                   125 non-null    int64
 39  italian_food                  125 non-null    int64
 40  life_rewarding                124 non-null    float64
 41  marital_status                124 non-null    float64
 42  meals_dinner_friend           122 non-null    object
 43  mother_education              122 non-null    float64
 44  mother_profession             123 non-null    object
 45  nutritional_check             125 non-null    int64
 46  on_off_campus                 124 non-null    float64
 47  parents_cook                  125 non-null    int64
 48  pay_meal_out                  125 non-null    int64
 49  persian_food                  124 non-null    float64
 50  self_perception_weight        124 non-null    float64
 51  soup                          124 non-null    float64
 52  sports                        123 non-null    float64
 53  thai_food                     125 non-null    int64
 54  tortilla_calories             124 non-null    float64
 55  turkey_calories               125 non-null    int64
 56  type_sports                   104 non-null    object
 57  veggies_day                   125 non-null    int64
 58  vitamins                      125 non-null    int64
 59  waffle_calories               125 non-null    int64
 60  weight                        123 non-null    object
dtypes: float64(20), int64(27), object(14)
memory usage: 59.7+ KB

### Clean the Data

Perhaps we’d like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. …and maybe gender.

Can you remove the other columns?

In [81]:
# Remove ‘em.
# not sure what remove mean in this case since I can just choose columns that i need and overwrite dataFrame
df_food = df_food[['calories_day', 'weight', 'Gender']]

In [82]:
df_food

     calories_day                    weight  Gender
0             NaN                       187       2
1             3.0                       155       1
2             4.0  I'm not answering this.        1
3             3.0             Not sure, 240       1
4             2.0                       190       1
..            ...                       ...     ...
120           4.0                       156       1
121           2.0                       180       1
122           NaN                       120       1
123           4.0                       135       2
124           NaN                       135       1

[125 rows x 3 columns]

What about `NaN`s? How many are there?

In [83]:
# Count ‘em.
df_food.isnull().sum()

calories_day    19
weight           2
Gender           0
dtype: int64

We gotta remove those `NaN`s―the entire row.

In [84]:
# Drop ‘em.
df_food = df_food.dropna()

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. 🤔

In [102]:
# Fix that.
# we have three non numeric values within weight column = ["I'm not answering this. ", "Not sure, 240", "144 lbs"]
# some of them we can drop, for others we can try extract numerical part and drop the restd
df_food = df_food.drop(df_food[df_food['weight'] == "I'm not answering this. "].index)
df_food.loc[df_food['weight'] == "Not sure, 240", "weight"] = df_food.loc[df_food['weight'] == "Not sure, 240", "weight"].apply(lambda x: int(x[-3:]))
df_food.loc[df_food['weight'] == "144 lbs", "weight"] = df_food.loc[df_food['weight'] == "144 lbs", "weight"].apply(lambda x: x[:3])
df_food['weight'] = df_food['weight'].apply(lambda x: int(x))

In [104]:
df_food.head(5)

   calories_day  weight  Gender
1           3.0     155       1
3           3.0     240       1
4           2.0     190       1
5           3.0     190       1
6           3.0     180       2

Now this data seems reasonably clean for our purposes! 😁

Let’s save it somewhere to be shipped off to another teammate. 💾

In [107]:
# Savey save!
df_food.to_csv("../data/df_food.csv")

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [109]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
df_salary  = pd.read_csv("../data/Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv", sep="\t")

Was that hard? 🙃

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

### Explore

You know the drill.

How much data did you just load?

In [111]:
# Count by hand. I’m dead serious.
df_salary.shape

(28062, 18)

What are the columns and their types?

In [114]:
# Show the column names and their types.
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28062 entries, 0 to 28061
Data columns (total 18 columns):
 #   Column                                                                                                                                                                                                                                Non-Null Count  Dtype
---  ------                                                                                                                                                                                                                                --------------  -----
 0   Timestamp                                                                                                                                                                                                                             28062 non-null  object
 1   How old are you?                                                                                                                                                                                                                      28062 non-null  object
 2   What industry do you work in?                                                                                                                                                                                                         27988 non-null  object
 3   Job title                                                                                                                                                                                                                             28061 non-null  object
 4   If your job title needs additional context, please clarify here:                                                                                                                                                                      7262 non-null   object
 5   What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)  28062 non-null  object
 6   How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                        20766 non-null  float64
 7   Please indicate the currency                                                                                                                                                                                                          28062 non-null  object
 8   If "Other," please indicate the currency here:                                                                                                                                                                                        208 non-null    object
 9   If your income needs additional context, please provide it here:                                                                                                                                                                      3043 non-null   object
 10  What country do you work in?                                                                                                                                                                                                          28062 non-null  object
 11  If you're in the U.S., what state do you work in?                                                                                                                                                                                     23039 non-null  object
 12  What city do you work in?                                                                                                                                                                                                             27984 non-null  object
 13  How many years of professional work experience do you have overall?                                                                                                                                                                   28062 non-null  object
 14  How many years of professional work experience do you have in your field?                                                                                                                                                             28062 non-null  object
 15  What is your highest level of education completed?                                                                                                                                                                                    27840 non-null  object
 16  What is your gender?                                                                                                                                                                                                                  27891 non-null  object
 17  What is your race? (Choose all that apply.)                                                                                                                                                                                           27885 non-null  object
dtypes: float64(1), object(17)
memory usage: 3.9+ MB

Oh… Ugh! Give these columns easier names to work with first. 🙄

In [116]:
# Rename ‘em.
# Non-binding suggestions: 
df_salary.columns = ["timestamp", "age", "industry", "title", "title_context", "salary", 
                     "additional_compensation", "currency", "other_currency", "salary_context",
                     "country", "state", "city", "total_yoe", "field_yoe", "highest_education_completed","gender", "race"]

In [117]:
df_salary.head(2)

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White

It’s a lot, and that should not have been easy. 😏

You’re going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [119]:
# List the unique industries and a count of their instances.
df_salary['industry'].value_counts()

Computing or Tech                          4699
Education (Higher Education)               2464
Nonprofits                                 2419
Health care                                1896
Government and Public Administration       1889
                                           ...
Gaming (Gambling)                             1
Regulatory Affairs- nutraceuticals            1
Manufacturing : corporate admin support       1
Real Estate Investment Support                1
Wine & Spirits                                1
Name: industry, Length: 1219, dtype: int64

That value among the top 5 is what you’re looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [139]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
df_salary_tech = df_salary[df_salary['industry'] == "Computing or Tech"].copy()

In [140]:
df_salary_tech.shape

(4699, 18)

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [141]:
# Sanity Check 
df_salary_tech['industry'].unique()

array(['Computing or Tech'], dtype=object)

We are very interested in salary figures. But how many dollars 💵 is a euro 💶 or a pound 💷? That sounds like a problem for another day. 🫠

For now, let’s just look at U.S. dollars (`'USD'`).

In [145]:
# Filtery filter for just the jobs that pay in USD!
df_salary_tech_usd = df_salary_tech[df_salary_tech['currency'] == 'USD'].copy()

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [146]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
df_salary_tech_usd['country'].value_counts()[:5]

United States               1576
USA                         1222
US                           412
U.S.                         108
United States of America      90
Name: country, dtype: int64

### Clean the Data

Well, we can’t get our answers with what we currently have, so you’ll have to make some changes.

Let’s not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value―say, `'US'`, which is nice and short.

In [161]:
# Replace them all with 'US'.
df_salary_tech_usd['country'].replace({
    "United States": "US",
    "United States of America":"US",
    "USA": "US",
    "U.S.": "US"
}, inplace=True)

Have a look at the count of each unique country again now.

In [160]:
# Count again.
df_salary_tech_usd['country'] = df_salary_tech_usd['country'].apply(lambda x: x.strip())

In [174]:
df_salary_tech_usd['country'].unique()

array(['US', 'America', 'Puerto Rico', 'Cuba', 'Danmark', 'Canada',
       'Italy', 'International', 'Israel', 'India',
       'Remote (philippines)', 'Singapore', 'Spain', 'Uruguay', 'Brazil',
       'Mexico', 'ISA', 'singapore', 'Pakistan', 'New Zealand', 'Poland',
       'France', 'Netherlands', 'China', 'San Francisco', 'Romania',
       'Japan', 'Denmark', 'Jamaica', 'Thailand', 'Colombia', 'denmark',
       'Ghana', 'Nigeria', 'ss', 'Burma'], dtype=object)

There are still some similiar namings of U.S but I guess it will take a while to get rid of them all

Did you notice anything interesting?

In [178]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.

# Okay I guess we can check for key phrace(prefix) that is shared by all such columns 
values = df_salary_tech_usd['country'].unique()
for val in values:
    if "us" in val.lower() or "united" in val.lower() or "state" in val.lower() or "u.s" in val.lower():
        df_salary_tech_usd.loc[df_salary_tech_usd['country'] == val, 'country'] = "US"

In [180]:
# BONUS CREDIT: if you’ve resolved it, let’s see how well you did by counting the number of instances of each unique value.
df_salary_tech_usd['country'].value_counts()

US                      3727
Israel                     5
Canada                     5
Poland                     2
New Zealand                2
Brazil                     2
Spain                      2
India                      2
France                     2
Nigeria                    2
Colombia                   1
Thailand                   1
Netherlands                1
denmark                    1
Denmark                    1
Ghana                      1
Japan                      1
Romania                    1
San Francisco              1
China                      1
ss                         1
Jamaica                    1
Pakistan                   1
America                    1
singapore                  1
ISA                        1
Mexico                     1
Uruguay                    1
Singapore                  1
Remote (philippines)       1
International              1
Italy                      1
Danmark                    1
Cuba                       1
Puerto Rico                1
Burma                      1
Name: country, dtype: int64

It’s looking good so far. Let’s find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [ ]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.
df_salary_tech_usd.groupby('state').agg(
    min_salary = ("salary","min"),
    mean_salary = ("salary","mean"),
    max_salary = ("salary","max"))

Well, pooh! We forgot that `salary` isn’t numeric. Something wrong must be fixed.

In [207]:
# Fix it.
df_salary_tech_usd["salary"] = df_salary_tech_usd["salary"].astype(str).str.replace(",", "").astype(float)

Let’s try that again.

In [212]:
# Try it again. Yeah!
df_salary_tech_usd.groupby('state').agg(
    min_salary = ("salary","min"),
    mean_salary = ("salary","mean"),
    max_salary = ("salary","max")
).reset_index().sort_values(by="mean_salary", ascending=False)

                          state  min_salary    mean_salary  max_salary
35  Michigan, Texas, Washington    340000.0  340000.000000    340000.0
10           California, Oregon    200000.0  200000.000000    200000.0
8          California, Colorado    176000.0  176000.000000    176000.0
18       Georgia, Massachusetts    175000.0  175000.000000    175000.0
16                      Florida     28800.0  157457.232143   2600000.0
..                          ...         ...            ...         ...
26                    Louisiana     35360.0   83269.090909    150000.0
32  Massachusetts, Pennsylvania     83000.0   83000.000000     83000.0
9          California, Maryland     81500.0   81500.000000     81500.0
6                      Arkansas         4.0   74257.000000    144000.0
2              Alabama, Montana     72000.0   72000.000000     72000.0

[66 rows x 4 columns]

That did the trick! Now let’s narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [216]:
df_salary_tech_usd["timestamp"] = pd.to_datetime(df_salary_tech_usd["timestamp"])

In [221]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.
report_df = df_salary_tech_usd[
    (df_salary_tech_usd["timestamp"].dt.year >= 2021) &
    (df_salary_tech_usd["timestamp"].dt.year <= 2023)
]

In [222]:
report_df.groupby('state').agg(
    min_salary = ("salary","min"),
    mean_salary = ("salary","mean"),
    max_salary = ("salary","max")
).reset_index().sort_values(by="mean_salary", ascending=False)

                            state  min_salary    mean_salary  max_salary
35    Michigan, Texas, Washington    340000.0  340000.000000    340000.0
10             California, Oregon    200000.0  200000.000000    200000.0
8            California, Colorado    176000.0  176000.000000    176000.0
18         Georgia, Massachusetts    175000.0  175000.000000    175000.0
1   Alabama, District of Columbia    156000.0  156000.000000    156000.0
..                            ...         ...            ...         ...
26                      Louisiana     35360.0   83269.090909    150000.0
32    Massachusetts, Pennsylvania     83000.0   83000.000000     83000.0
6                        Arkansas     55000.0   81682.300000    144000.0
9            California, Maryland     81500.0   81500.000000     81500.0
2                Alabama, Montana     72000.0   72000.000000     72000.0

[66 rows x 4 columns]

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you’ve now reached. What do you notice about Delaware and West Virginia?

Let’s back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

In [230]:
virgina_and_delaware = df_salary[(df_salary['state'] == "Delaware") | (df_salary['state'] == "West Virginia")]

In [232]:
virgina_and_delaware['state'].value_counts()

Delaware         47
West Virginia    42
Name: state, dtype: int64

In [ ]:
virgina_and_delaware["salary"] = virgina_and_delaware["salary"].astype(str).str.replace(",", "").astype(float)

In [242]:
virgina_and_delaware.groupby('state').agg(
    min_salary = ("salary","min"),
    mean_salary = ("salary","mean"),
    max_salary = ("salary","max")
).reset_index().sort_values(by="mean_salary", ascending=False)

           state  min_salary   mean_salary  max_salary
0       Delaware     35000.0  86398.148936    220000.0
1  West Virginia         0.0  59162.928571    125000.0

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

In [236]:
df_salary["salary"] = df_salary["salary"].astype(str).str.replace(",", "").astype(float)

In [237]:
df_salary.groupby('state').agg(
    min_salary = ("salary","min"),
    mean_salary = ("salary","mean"),
    max_salary = ("salary","max")
).reset_index().sort_values(by="mean_salary", ascending=False)

,state,min_salary,mean_salary,max_salary
8,"Alabama, South Carolina",5000000.0,5.000000e+06,5000000.0
89,"Michigan, Texas, Washington",340000.0,3.400000e+05,340000.0
66,"Indiana, Ohio",245000.0,2.450000e+05,245000.0
9,Alaska,27040.0,2.286546e+05,10000000.0
39,"Colorado, Nevada",190000.0,1.900000e+05,190000.0
...,...,...,...,...
2,"Alabama, California",29120.0,2.912000e+04,29120.0
45,"District of Columbia, Maryland, Pennsylvania, ...",27040.0,2.704000e+04,27040.0
79,"Maryland, New York",14000.0,1.400000e+04,14000.0
1,"Alabama, Alaska, Arizona",15.0,1.500000e+01,15.0
36,"Colorado, Delaware, New Jersey, West Virginia,...",5.0,5.000000e+00,5.0

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

no idea how to do that

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

In [266]:
correct_states = df_salary[~df_salary['state'].str.contains(',', na=False)]

correct_states['state'].value_counts()

California              2610
New York                2173
Massachusetts           1522
Texas                   1268
Illinois                1213
Washington              1184
District of Columbia     983
Pennsylvania             943
Virginia                 786
Minnesota                723
Ohio                     655
Colorado                 632
Oregon                   626
North Carolina           601
Maryland                 564
Michigan                 545
Georgia                  537
Florida                  522
Wisconsin                469
New Jersey               399
Missouri                 342
Indiana                  328
Arizona                  302
Tennessee                282
Connecticut              238
Utah                     208
Kentucky                 191
Iowa                     179
Kansas                   153
South Carolina           147
Louisiana                129
Maine                    126
Alabama                  122
New Hampshire            118
Oklahoma                 113
Nebraska                 110
New Mexico                98
Idaho                     97
Nevada                    93
Rhode Island              76
Arkansas                  71
Vermont                   68
Alaska                    66
Montana                   64
Mississippi               51
Delaware                  47
West Virginia             42
North Dakota              35
Hawaii                    30
South Dakota              25
Wyoming                   24
Name: state, dtype: int64

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum―say 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you―like say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* 😜)

In [273]:
quantiles = [0.0,0.05,0.25,0.5]

df_salary['salary'].quantile(0.5)

75000.0